report_01_100users_loop1/statistics.json
{
  "HTTP Request | Update character" : {
    "transaction" : "HTTP Request | Update character",
    "sampleCount" : 100,
    "errorCount" : 42,
    "errorPct" : 42.0,
    "meanResTime" : 136.39,
    "medianResTime" : 152.5,
    "minResTime" : 4.0,
    "maxResTime" : 326.0,
    "pct1ResTime" : 173.9,
    "pct2ResTime" : 311.9999999999984,
    "pct3ResTime" : 326.0,
    "throughput" : 63.011972274732194,
    "receivedKBytesPerSec" : 17.173223850031505,
    "sentKBytesPerSec" : 14.295225858538123
  },
  "HTTP Request | Delete character" : {
    "transaction" : "HTTP Request | Delete character",
    "sampleCount" : 100,
    "errorCount" : 42,
    "errorPct" : 42.0,
    "meanResTime" : 138.5,
    "medianResTime" : 170.0,
    "minResTime" : 4.0,
    "maxResTime" : 205.0,
    "pct1ResTime" : 175.0,
    "pct2ResTime" : 175.95,
    "pct3ResTime" : 204.98,
    "throughput" : 78.67820613690007,
    "receivedKBytesPerSec" : 21.86700924468922,
    "sentKBytesPerSec" : 14.171297206923683
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 500,
    "errorCount" : 126,
    "errorPct" : 25.2,
    "meanResTime" : 570.9380000000001,
    "medianResTime" : 176.0,
    "minResTime" : 3.0,
    "maxResTime" : 4779.0,
    "pct1ResTime" : 1704.7,
    "pct2ResTime" : 3481.749999999999,
    "pct3ResTime" : 4688.76,
    "throughput" : 89.14244963451596,
    "receivedKBytesPerSec" : 16518.25069781824,
    "sentKBytesPerSec" : 16.750249320288823
  },
  "HTTP Request | Get all characters" : {
    "transaction" : "HTTP Request | Get all characters",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2176.0299999999997,
    "medianResTime" : 1703.5,
    "minResTime" : 210.0,
    "maxResTime" : 4779.0,
    "pct1ResTime" : 4582.900000000001,
    "pct2ResTime" : 4687.799999999999,
    "pct3ResTime" : 4778.8099999999995,
    "throughput" : 17.908309455587393,
    "receivedKBytesPerSec" : 16572.49542498657,
    "sentKBytesPerSec" : 2.763196185530086
  },
  "HTTP Request | Get character by id" : {
    "transaction" : "HTTP Request | Get character by id",
    "sampleCount" : 100,
    "errorCount" : 42,
    "errorPct" : 42.0,
    "meanResTime" : 227.11,
    "medianResTime" : 265.0,
    "minResTime" : 3.0,
    "maxResTime" : 374.0,
    "pct1ResTime" : 363.0,
    "pct2ResTime" : 367.9,
    "pct3ResTime" : 373.99,
    "throughput" : 57.736720554272516,
    "receivedKBytesPerSec" : 15.640223549364896,
    "sentKBytesPerSec" : 9.158938366050808
  },
  "HTTP Request | Create character" : {
    "transaction" : "HTTP Request | Create character",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 176.66000000000005,
    "medianResTime" : 194.0,
    "minResTime" : 4.0,
    "maxResTime" : 320.0,
    "pct1ResTime" : 303.5,
    "pct2ResTime" : 313.0,
    "pct3ResTime" : 320.0,
    "throughput" : 59.73715651135006,
    "receivedKBytesPerSec" : 16.6774006869773,
    "sentKBytesPerSec" : 13.118839605734767
  }
}