report_04_1000users_30sec/statistics.json
{
  "HTTP Request | Update character" : {
    "transaction" : "HTTP Request | Update character",
    "sampleCount" : 803,
    "errorCount" : 371,
    "errorPct" : 46.201744,
    "meanResTime" : 58.960149439601494,
    "medianResTime" : 29.0,
    "minResTime" : 3.0,
    "maxResTime" : 430.0,
    "pct1ResTime" : 100.60000000000002,
    "pct2ResTime" : 359.39999999999986,
    "pct3ResTime" : 414.0,
    "throughput" : 34.450212364322795,
    "receivedKBytesPerSec" : 9.378460640203354,
    "sentKBytesPerSec" : 7.811033627032477
  },
  "HTTP Request | Delete character" : {
    "transaction" : "HTTP Request | Delete character",
    "sampleCount" : 802,
    "errorCount" : 371,
    "errorPct" : 46.25935,
    "meanResTime" : 49.497506234413954,
    "medianResTime" : 29.0,
    "minResTime" : 3.0,
    "maxResTime" : 272.0,
    "pct1ResTime" : 95.10000000000014,
    "pct2ResTime" : 258.0,
    "pct3ResTime" : 265.0,
    "throughput" : 34.99890901156448,
    "receivedKBytesPerSec" : 9.69812009055204,
    "sentKBytesPerSec" : 6.297986444468689
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5256,
    "errorCount" : 2059,
    "errorPct" : 39.17428,
    "meanResTime" : 7561.769406392689,
    "medianResTime" : 36.0,
    "minResTime" : 3.0,
    "maxResTime" : 60027.0,
    "pct1ResTime" : 22268.0,
    "pct2ResTime" : 42047.35,
    "pct3ResTime" : 56575.20000000001,
    "throughput" : 85.27760651588409,
    "receivedKBytesPerSec" : 27051.26086428554,
    "sentKBytesPerSec" : 14.609650061248662
  },
  "HTTP Request | Get all characters" : {
    "transaction" : "HTTP Request | Get all characters",
    "sampleCount" : 1801,
    "errorCount" : 705,
    "errorPct" : 39.14492,
    "meanResTime" : 16360.838423098248,
    "medianResTime" : 15264.0,
    "minResTime" : 3.0,
    "maxResTime" : 60027.0,
    "pct1ResTime" : 32656.0,
    "pct2ResTime" : 44964.59999999999,
    "pct3ResTime" : 57098.0,
    "throughput" : 29.22088457669468,
    "receivedKBytesPerSec" : 27034.926488296842,
    "sentKBytesPerSec" : 3.810232075640069
  },
  "HTTP Request | Get character by id" : {
    "transaction" : "HTTP Request | Get character by id",
    "sampleCount" : 1020,
    "errorCount" : 586,
    "errorPct" : 57.45098,
    "meanResTime" : 8868.864705882348,
    "medianResTime" : 20.5,
    "minResTime" : 3.0,
    "maxResTime" : 42647.0,
    "pct1ResTime" : 42312.9,
    "pct2ResTime" : 42401.85,
    "pct3ResTime" : 42554.58,
    "throughput" : 23.731416207161303,
    "receivedKBytesPerSec" : 7.774965246271608,
    "sentKBytesPerSec" : 3.6510727487145482
  },
  "HTTP Request | Create character" : {
    "transaction" : "HTTP Request | Create character",
    "sampleCount" : 830,
    "errorCount" : 26,
    "errorPct" : 3.1325302,
    "meanResTime" : 1380.1277108433735,
    "medianResTime" : 29.0,
    "minResTime" : 4.0,
    "maxResTime" : 42095.0,
    "pct1ResTime" : 275.0,
    "pct2ResTime" : 703.7999999999997,
    "pct3ResTime" : 42065.45,
    "throughput" : 19.71168689291567,
    "receivedKBytesPerSec" : 5.503649927565488,
    "sentKBytesPerSec" : 4.329418579452348
  }
}