report_05_5000users_60sec/statistics.json
{
  "HTTP Request | Update character" : {
    "transaction" : "HTTP Request | Update character",
    "sampleCount" : 2447,
    "errorCount" : 1738,
    "errorPct" : 71.02575,
    "meanResTime" : 11882.851246424187,
    "medianResTime" : 28.0,
    "minResTime" : 0.0,
    "maxResTime" : 145088.0,
    "pct1ResTime" : 31415.800000000716,
    "pct2ResTime" : 139360.2,
    "pct3ResTime" : 143924.16,
    "throughput" : 16.832793335672175,
    "receivedKBytesPerSec" : 19.198151572098286,
    "sentKBytesPerSec" : 2.2876811743745313
  },
  "HTTP Request | Delete character" : {
    "transaction" : "HTTP Request | Delete character",
    "sampleCount" : 2201,
    "errorCount" : 1494,
    "errorPct" : 67.878235,
    "meanResTime" : 14095.636528850519,
    "medianResTime" : 30.0,
    "minResTime" : 1.0,
    "maxResTime" : 145111.0,
    "pct1ResTime" : 73227.79999999999,
    "pct2ResTime" : 141727.6,
    "pct3ResTime" : 143950.0,
    "throughput" : 15.149637950496958,
    "receivedKBytesPerSec" : 15.000321030705377,
    "sentKBytesPerSec" : 1.8101198019912723
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 18273,
    "errorCount" : 13750,
    "errorPct" : 75.247635,
    "meanResTime" : 30978.808241668114,
    "medianResTime" : 36.0,
    "minResTime" : 0.0,
    "maxResTime" : 152388.0,
    "pct1ResTime" : 141944.6,
    "pct2ResTime" : 146988.0,
    "pct3ResTime" : 151100.78,
    "throughput" : 118.3009413318486,
    "receivedKBytesPerSec" : 21468.86772211774,
    "sentKBytesPerSec" : 10.7401327369353
  },
  "HTTP Request | Get all characters" : {
    "transaction" : "HTTP Request | Get all characters",
    "sampleCount" : 6948,
    "errorCount" : 5905,
    "errorPct" : 84.98849,
    "meanResTime" : 49485.51338514673,
    "medianResTime" : 20541.5,
    "minResTime" : 1.0,
    "maxResTime" : 152388.0,
    "pct1ResTime" : 148523.9,
    "pct2ResTime" : 150261.0,
    "pct3ResTime" : 151559.65,
    "throughput" : 44.98193730496821,
    "receivedKBytesPerSec" : 21378.230770351285,
    "sentKBytesPerSec" : 2.9258688018736003
  },
  "HTTP Request | Get character by id" : {
    "transaction" : "HTTP Request | Get character by id",
    "sampleCount" : 3869,
    "errorCount" : 3161,
    "errorPct" : 81.7007,
    "meanResTime" : 32043.88033083479,
    "medianResTime" : 20.0,
    "minResTime" : 0.0,
    "maxResTime" : 146003.0,
    "pct1ResTime" : 141826.0,
    "pct2ResTime" : 144674.0,
    "pct3ResTime" : 145766.0,
    "throughput" : 26.498185055818094,
    "receivedKBytesPerSec" : 37.51259411812547,
    "sentKBytesPerSec" : 1.8848639433942882
  },
  "HTTP Request | Create character" : {
    "transaction" : "HTTP Request | Create character",
    "sampleCount" : 2808,
    "errorCount" : 1452,
    "errorPct" : 51.7094,
    "meanResTime" : 13593.593304843305,
    "medianResTime" : 27.0,
    "minResTime" : 1.0,
    "maxResTime" : 145702.0,
    "pct1ResTime" : 71636.59999999999,
    "pct2ResTime" : 139239.1,
    "pct3ResTime" : 143376.22,
    "throughput" : 19.271948608137045,
    "receivedKBytesPerSec" : 24.382239634807554,
    "sentKBytesPerSec" : 2.3077877494783943
  }
}